# Напишите процедуру, которая выводит на экран
# запись переданного ей числа в римской системе счисления.
# Числа находятся в диапазоне [1, 3999]
# I - 1, V - 5, X - 10, L - 50, C  - 100, D - 500, M - 1000
# Пример:
# 2013
# MMXIII
def q(n):
    if not (1 <= n <= 3999):
        return "Число должно быть в диапазоне от 1 до 3999"

    v = [1000, 900, 500, 400, 100, 90, 50, 40, 10, 9, 5, 4, 1] # cписок в нашей системе счисления
    s = ["M", "CM", "D", "CD", "C", "XC", "L", "XL", "X", "IX", "V", "IV", "I"] # список в римской

    r = ""
    i = 0

    while n > 0:
        while n >= v[i]:
            r += s[i]
            n -= v[i]
        i += 1
    return r
